Revit 2024 API
PipePressureDropData.ReynoldsNumber Property
 The reynolds number of the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double ReynoldsNumber { get; set; }
Visual Basic
Public Property ReynoldsNumber As Double
	Get
	Set
Visual C++
public:
property double ReynoldsNumber {
	double get ();
	void set (double value);
}
See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace